docker/docker-practices.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-25 三 16:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Docker Practices</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Docker Practices</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgddec8a9">1. 什么是 docker（what）</a></li>
<li><a href="#orgbbaa2a2">2. 为什么需要 docker</a></li>
<li><a href="#org5dd1d93">3. 它是如何做到的</a></li>
<li><a href="#org36b9252">4. 运行架构</a>
<ul>
<li><a href="#org1ccf7a0">4.1. dokcer daemon</a></li>
<li><a href="#orgfc9b5fa">4.2. dokcer client</a></li>
<li><a href="#orgb54e4c3">4.3. 远程服务</a></li>
</ul>
</li>
<li><a href="#org6ab4727">5. 核心概念</a>
<ul>
<li><a href="#orgaebb09b">5.1. 镜像（image）</a>
<ul>
<li><a href="#org7dd2c91">5.1.1. dockfile</a></li>
</ul>
</li>
<li><a href="#orgcfd8c3d">5.2. 容器（container）</a></li>
</ul>
</li>
<li><a href="#orgfabc30c">6. 容器（containers）</a></li>
<li><a href="#orgc1d630f">7. 服务（services）</a></li>
<li><a href="#org823cf7d">8. stack</a></li>
<li><a href="#orga5b9efc">9. 安装</a></li>
<li><a href="#orgc29ad5d">10. Docker Hub Mirror</a>
<ul>
<li><a href="#org94a37e8">10.1. daocloud 加速器</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgddec8a9" class="outline-2">
<h2 id="orgddec8a9"><span class="section-number-2">1</span> 什么是 docker（what）</h2>
<div class="outline-text-2" id="text-1">
<p>
Docker<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>是一个软件，它简化软件的安装，运行，发布和删除。
</p>
</div>
</div>

<div id="outline-container-orgbbaa2a2" class="outline-2">
<h2 id="orgbbaa2a2"><span class="section-number-2">2</span> 为什么需要 docker</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>隔离软件运行环境</li>
</ul>
</div>
</div>

<div id="outline-container-org5dd1d93" class="outline-2">
<h2 id="org5dd1d93"><span class="section-number-2">3</span> 它是如何做到的</h2>
<div class="outline-text-2" id="text-3">
<p>
docker 使用 Unix 已有的容器技术，基于最佳实践，提供一种软件构建方案。
</p>

<p>
docker 并不提供容器技术，但它使容器技术更易于使用。
</p>

<p>
与虚拟机不同，docker 不需要虚拟化硬件。
</p>
</div>
</div>

<div id="outline-container-org36b9252" class="outline-2">
<h2 id="org36b9252"><span class="section-number-2">4</span> 运行架构</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1ccf7a0" class="outline-3">
<h3 id="org1ccf7a0"><span class="section-number-3">4.1</span> dokcer daemon</h3>
<div class="outline-text-3" id="text-4-1">
<p>
守护进程，管理 images，运行的 container。
</p>
</div>
</div>

<div id="outline-container-orgfc9b5fa" class="outline-3">
<h3 id="orgfc9b5fa"><span class="section-number-3">4.2</span> dokcer client</h3>
<div class="outline-text-3" id="text-4-2">
<p>
客户端接口。
</p>
</div>
</div>

<div id="outline-container-orgb54e4c3" class="outline-3">
<h3 id="orgb54e4c3"><span class="section-number-3">4.3</span> 远程服务</h3>
<div class="outline-text-3" id="text-4-3">
<p>
containers
</p>
</div>
</div>
</div>

<div id="outline-container-org6ab4727" class="outline-2">
<h2 id="org6ab4727"><span class="section-number-2">5</span> 核心概念</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgaebb09b" class="outline-3">
<h3 id="orgaebb09b"><span class="section-number-3">5.1</span> 镜像（image）</h3>
<div class="outline-text-3" id="text-5-1">
<p>
镜像是容器中运行程序所有文件的快照。它用于容器分发。
</p>
</div>

<div id="outline-container-org7dd2c91" class="outline-4">
<h4 id="org7dd2c91"><span class="section-number-4">5.1.1</span> dockfile</h4>
</div>
</div>

<div id="outline-container-orgcfd8c3d" class="outline-3">
<h3 id="orgcfd8c3d"><span class="section-number-3">5.2</span> 容器（container）</h3>
</div>
</div>

<div id="outline-container-orgfabc30c" class="outline-2">
<h2 id="orgfabc30c"><span class="section-number-2">6</span> 容器（containers）</h2>
</div>
<div id="outline-container-orgc1d630f" class="outline-2">
<h2 id="orgc1d630f"><span class="section-number-2">7</span> 服务（services）</h2>
<div class="outline-text-2" id="text-7">
<p>
服务只运行一个镜像，但它定义了镜像运行的方式：应该使用哪些端口，对应服务能力应该运行多少个容器副本等等。
</p>
</div>
</div>

<div id="outline-container-org823cf7d" class="outline-2">
<h2 id="org823cf7d"><span class="section-number-2">8</span> stack</h2>
<div class="outline-text-2" id="text-8">
<p>
stack 是一组相互关联的服务，它们共享依赖关系，并且可以协调和缩放在一起。
</p>
</div>
</div>

<div id="outline-container-orga5b9efc" class="outline-2">
<h2 id="orga5b9efc"><span class="section-number-2">9</span> 安装<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><p>
安装包以允许通过 HTTPS 使用代码库：
</p>
<pre class="example">
sudo apt install apt-transport-https ca-certificates curl software-properties-common
</pre></li>

<li><p>
安装 Docker 的官方 GPG 密钥：
</p>
<div class="org-src-container">
<pre class="src src-sh">curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -
</pre>
</div>

<p>
验证秘钥：
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo apt-key fingerprint 0EBFCD88
</pre>
</div></li>
<li><p>
设定 stable 仓库。
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo add-apt-repository <span style="color: #ff4ea3;">"deb [arch=amd64] https://download.docker.com/linux/ubuntu $(</span><span style="color: #fa8072;">lsb_release</span><span style="color: #ff4ea3;"> -cs) stable"</span>
</pre>
</div>

<p>
上面的 <code>lsb_release -cs</code> 子命令返回您的 Ubuntu 发行版的名称，例如 xenial。 有时，在像 Linux Mint 这样的发行版中，您可能需要将 <code>$(lsb_release -cs)</code> 更改为您的父 Ubuntu 发行版。 例如，如果您使用的是 Linux Mint Rafaela，则可以使用 trusty。
</p>

<p>
对于 mint，可以如下获取对应 ubuntu 的 codename：
</p>
<div class="org-src-container">
<pre class="src src-sh">grep DISTRIB_CODENAME /etc/upstream-release/lsb-release | grep -o --colour=never <span style="color: #ff4ea3;">"[a-z-]*$"</span>
</pre>
</div></li>
<li><p>
安装 docker-ce
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo apt update
sudo apt install docker-ce
</pre>
</div></li>
<li><p>
确认安装
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo docker run hello-world
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">docker -v
</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="auto">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Docker version 19.03.8</td>
<td class="org-left">build afacb8b7f0</td>
</tr>
</tbody>
</table></li>
</ul>

<p>
Docker 守护程序绑定到 Unix 套接字而不是 TCP 端口。 默认情况下，Unix 套接字由用户 root 拥有，而其他用户只能使用 sudo 访问它。Docker 守护程序始终以 root 用户身份运行。
</p>

<p>
如果您不想在 docker 命令前加上 sudo，请创建一个名为 docker 的 Unix 组并向其添加用户。 当 Docker 守护程序启动时，它会创建一个可由 docker 组成员访问的 Unix 套接字。
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo groupadd docker
sudo usermod -aG docker $<span style="color: #ff8700;">USER</span>
</pre>
</div>

<p>
重新登录以后生效，然后确认：
</p>
<div class="org-src-container">
<pre class="src src-sh">docker run hello-world
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc29ad5d" class="outline-2">
<h2 id="orgc29ad5d"><span class="section-number-2">10</span> Docker Hub Mirror</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org94a37e8" class="outline-3">
<h3 id="org94a37e8"><span class="section-number-3">10.1</span> daocloud 加速器<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></h3>
<div class="outline-text-3" id="text-10-1">
<p>
使用 Docker 的时候，需要经常从官方获取镜像，但是由于显而易见的网络原因，拉取镜像的过程非常耗时，严重影响使用 Docker 的体验。因此 DaoCloud 推出了加速器工具解决这个难题，通过智能路由和缓存机制，极大提升了国内网络访问 Docker Hub 的速度，目前已经拥有了广泛的用户群体，并得到了 Docker 官方的大力推荐。如果您是在国内的网络环境使用 Docker，那么 Docker 加速器一定能帮助到您。
</p>

<div class="org-src-container">
<pre class="src src-sh">curl -sSL https://get.daocloud.io/daotools/set_mirror.sh | sudo sh -s http://4ca8d72b.m.daocloud.io
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.docker.com/">Docker 官网</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://docs.docker.com/install/linux/docker-ce/ubuntu/#install-using-the-repository">install docker from resposity</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.daocloud.io/mirror#accelerator-doc">https://www.daocloud.io/mirror#accelerator-doc</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmail.com">phenix3443@gmail.com</a></p>
<p class="date">Created: 2020-03-25 三 16:17</p>
<p class="validation"></p>
</div>
</body>
</html>
